aaron-bond.better-comments
anthropic.claude-code
atommaterial.a-file-icon-vscode
beardedbear.beardedicons
beardedbear.beardedtheme
bierner.markdown-preview-github-styles
bmewburn.vscode-intelephense-client
bradlc.vscode-tailwindcss
catppuccin.catppuccin-vsc-icons
christian-kohler.npm-intellisense
christian-kohler.path-intellisense
circlecodesolution.ccs-flutter-color
csstools.postcss
dbaeumer.vscode-eslint
devsense.composer-php-vscode
devsense.phptools-vscode
docker.docker
drcika.apc-extension
dsznajder.es7-react-js-snippets
dual.zsh-completion-script
eamodio.gitlens
ecmel.vscode-html-css
editorconfig.editorconfig
enkia.tokyo-night
esbenp.prettier-vscode
fey.oscura
figma.figma-vscode-extension
firsttris.vscode-jest-runner
formulahendry.auto-close-tag
formulahendry.auto-complete-tag
formulahendry.auto-rename-tag
formulahendry.code-runner
fractalbrew.backticks
gencer.html-slim-scss-css-class-completion
github.copilot
github.copilot-chat
github.vscode-pull-request-github
glenn2223.live-sass
graphql.vscode-graphql-syntax
humao.rest-client
imgildev.vscode-nestjs-snippets-extension
kisstkondoros.vscode-gutter-preview
l-igh-t.vscode-theme-seti-folder
laravel.vscode-laravel
mechatroner.rainbow-csv
mhutchie.git-graph
miguelsolorio.fluent-icons
miguelsolorio.min-theme
miguelsolorio.symbols
mikestead.dotenv
mrmlnc.vscode-scss
ms-azuretools.vscode-containers
ms-azuretools.vscode-docker
ms-ceintl.vscode-language-pack-pt-br
ms-kubernetes-tools.vscode-kubernetes-tools
ms-python.debugpy
ms-python.python
ms-python.vscode-pylance
ms-python.vscode-python-envs
ms-vscode-remote.remote-containers
ms-vscode-remote.remote-ssh
ms-vscode-remote.remote-ssh-edit
ms-vscode-remote.remote-wsl
ms-vscode-remote.vscode-remote-extensionpack
ms-vscode.cmake-tools
ms-vscode.cpp-devtools
ms-vscode.cpptools
ms-vscode.cpptools-extension-pack
ms-vscode.cpptools-themes
ms-vscode.js-debug-nightly
ms-vscode.live-server
ms-vscode.remote-explorer
ms-vscode.remote-server
ms-vscode.vscode-typescript-next
ms-vsliveshare.vsliveshare
naumovs.color-highlight
oderwat.indent-rainbow
onecentlin.laravel-blade
onecentlin.laravel5-snippets
orta.vscode-jest
pkief.material-icon-theme
pmndrs.pmndrs
postman.postman-for-vscode
pranaygp.vscode-css-peek
prisma.prisma
redhat.vscode-yaml
repreng.csv
ritwickdey.liveserver
rocketseat.theme-omni
sibiraj-s.vscode-scss-formatter
simonsiefke.svg-preview
streetsidesoftware.code-spell-checker
streetsidesoftware.code-spell-checker-portuguese-brazilian
styled-components.vscode-styled-components
subframe7536.custom-ui-style
syler.sass-indented
tal7aouy.icons
usernamehw.errorlens
vincaslt.highlight-matching-tag
vivaxy.vscode-conventional-commits
vscode-icons-team.vscode-icons
vue.volar
vunguyentuan.vscode-postcss
wallabyjs.quokka-vscode
wix.vscode-import-cost
xabikos.javascriptsnippets
xdebug.php-debug
zignd.html-css-class-completion
